public class Main {
    public static void main(String[] args) {

//        Задание 6.
//        И снова дела банковские, уже сложнее.
//        В нашем банке можно, кроме дебетовых, получать еще и кредитные карты. У таких карт есть допустимый лимит средств,
//        который рассчитывается исходя из возраста клиента и его зарплаты.
//        Правила расчета следующие:
//        - Людям старше (или равно) 23 лет мы предоставляем лимит в размере 3 зарплат.
//        - Людям младше 23 лет мы предоставляем лимит в размере 2 зарплат.
//        - Если заработная плата клиента выше (или равно) 50 тысяч, мы увеличиваем лимит в 1.2 раза.
//        - Если заработная плата выше (или равно) 80 тысяч, мы увеличиваем лимит в 1.5 раза.
//        Наша задача: написать программу, которая показывает, какую сумму на кредитке может получить клиент.
//        Вводные данные: переменная age = 19 для обозначения возраста клиента,
//        salary = 58_000 для обозначения зарплаты клиента.
//        Увеличения не могут быть применены одновременно. Необходимо вывести максимальный лимит в консоль в формате:
//        «Мы готовы выдать вам кредитную карту с лимитом *** рублей».

        System.out.println();
        System.out.println("Результат выполнения задачи 6:");

        int age = 19;
        double salary = 58_000;
        double creditLimitMax, creditLimit;
        if (23 <= age) {
            creditLimit = 3 * salary;
        }
        else {
            creditLimit = 2 * salary;
        }
        if (80_000 <= salary) {
            creditLimitMax = 1.5 * creditLimit;
        }
        else if (50_000 <= salary) {
            creditLimitMax = 1.2 * creditLimit;
        }
        else {
            creditLimitMax = creditLimit;
        }
        System.out.println("Мы готовы выдать вам кредитную карту с лимитом " + (int)creditLimitMax + " рублей.");

//        Задание 7.
//        Расширим задачу с кредитованием. Прежде чем выдавать кредиты наш банк проводит аудит и оценивает клиентов и их
//        возможность выплачивать кредит. Для того, чтобы вывести предварительное решение, нам необходимо использовать данные
//        о возрасте, зарплате и желаемой сумме.
//        Правила следующие:
//        Базовая ставка для клиента — 10% годовых. Срок кредитования — 12 месяцев. Максимальный ежемесячный платеж — 50% от ЗП.
//        Если возраст меньше 23, то добавляем 1% к ставке.Если возраст меньше 30, то добавляем 0.5% к ставке. Если зарплата больше
//        80_000, уменьшаем ставку на 0.7%.
//        Нам нужно написать программу для предварительного одобрения/отказа заявки по кредиту.
//        Вводные данные: используйте переменные age = 25 для обозначения возраста,salary = 60_000 для обозначения зарплаты,
//        wantedSum = 330_000 для обозначения желаемой суммы кредита.
//        Подсчитайте и выведите ответ, одобрен кредит или нет. На основании зарплаты подсчитайте максимальный допустимый платеж.
//        Если максимальный допустимый платеж по ЗП больше стандартного платежа по кредиту согласно процентной ставке, то кредит одобрен,
//        если меньше — отказан.
//        Пример ответа в консоль: «Максимальный платеж при ЗП *** равен *** рублей. Платеж по кредиту *** рублей. Одобрено/отказано».

        System.out.println();
        System.out.println("Результат выполнения задачи 7:");

        int AGE = 25;
        double SALARY = 60_000;
        double wantedSum = 330_000;
        double maxPayment = SALARY * 0.5;
        double rate = 0.1;
        if (AGE < 23) {
            rate += 0.01;
        }
        else if (AGE < 30) {
            rate += 0.005;
        }
        if (80_000 <= SALARY) {
            rate = rate - 0.007;
        }
        double monthlyPayment = (wantedSum + wantedSum * rate) / 12;
        if (monthlyPayment <= maxPayment) {
            System.out.println("Максимальный платеж при ЗП " + (int)SALARY + " равен " + (int)maxPayment + " рублей. " +
                    "Платеж по кредиту " + (int)monthlyPayment + " рублей. ОДОБРЕНО.");
        }
        else {
            System.out.println("Максимальный платеж при ЗП " + (int)SALARY + " равен " + (int)maxPayment + " рублей. " +
                    "Платеж по кредиту " + (int)monthlyPayment + " рублей. ОТКАЗАНО.");
        }
    }
}